# ConnectionInputPointInfo Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionInputPointInfo Constructor
ConnectionInputPointInfo Class See Also
---
Construct a default input point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ConnectionInputPointInfo()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ConnectionInputPointInfo()
```

# See Also
ConnectionInputPointInfo Class
ConnectionInputPointInfo Overload
Autodesk.Revit.DB.Structure Namespace